app/Http/Controllers/AboutController.php

select count(*) as aggregate from `users` where `role` = 0 and `users`.`deleted_at` is null
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select count(*) as aggregate from `brands` where `brands`.`deleted_at` is null
---
    public function index()
    {
        $countUser = User::where('role', 0)->count();
        $countProduct = Product::count();
        $countBrand = Brand::count();