app/Http/Controllers/AccountControllerAdmin.php

    public function submitFormLogin(Request $request)
    {
        $request->validate([
            'username' => 'required',
            'password' => 'required',
        ]);
        $user = User::where('username', $request->username)->where('active', 1)->first();
---
select * from `users` where `username` = 'admin@108' and `active` = 1 and `users`.`deleted_at` is null limit 1