app/Http/Controllers/BillControllerAdmin.php

select * from `orders` order by `id` desc
select * from `users` where `users`.`id` in (21, 28, 29, 31, 32) and `users`.`deleted_at` is null
---
    public function index()
    {
        $bills = Order::orderByDesc('id')->get();
        $bills->load('user');

select * from `images`
select * from `orders` where `id` = '84' limit 1
select * from `carts` where `idOrder` = '84'
---
    public function detailBill($id)
    {
        $images = Image::all();
        $bill = Order::where('id', $id)->first();
        $carts = Cart::where('idOrder', $id)->get();

select * from `orders` where `id` = '75' limit 1
update `orders` set `status` = '1', `orders`.`updated_at` = '2024-08-06 07:31:02' where `id` = '84'
---
    public function updateBill($id, Request $request)
    {
        Order::where('id', $id)->update(['status' => $request->status]);

select * from `images`
select * from `carts` where `idOrder` = '75'
select * from `products` where `products`.`id` in (26)
---
    public function invoice($id)
    {
        $images = Image::all();
        $bill = Order::where('id', $id)->first();
        $carts = Cart::where('idOrder', $id)->get();
        $carts->load(['product' => function ($query) {
            $query->withTrashed(); // Load cả sản phẩm đã bị xóa
        }]);;