app/Http/Controllers/BlogControllerAdmin.php

select `id`, `idBlog`, `srcImage` from `images` where `images`.`idBlog` in (5, 6, 11)
select `id`, `title`, `deleted_at` from `blogs`
---
    public function index()
    {
        $blogs = Blog::withTrashed()->select('id', 'title', 'deleted_at')->with(['image' => function ($query) {
            $query->select('id', 'idBlog', 'srcImage');
        }])->get();