app/Http/Controllers/BlogController.php

select `id`, `idBlog`, `srcImage` from `images` where `images`.`idBlog` in (5, 6)
select `id`, `title`, `created_at`, `deleted_at` from `blogs` where `blogs`.`deleted_at` is null
---
    public function index()
    {
        $blogs = Blog::select('id', 'title', 'created_at', 'deleted_at')->with(['image' => function ($query) {
            $query->select('id', 'idBlog', 'srcImage');
        }])->get();

select * from `blogs` where `id` != 5 and `blogs`.`deleted_at` is null order by `created_at` desc limit 2
---
    public function show(Blog $blog)
    {
        $latestBlogs = Blog::where('id', '!=', $blog->id)
            ->latest('created_at')
            ->take(2)
            ->get();