app/Http/Controllers/DashboardController.php

    public function filter_by_date(Request $request)
    {
        $data = $request->all();
        $from_date = isset($data['from_date']) ? $data['from_date'] : now()->subDays(30)->format('Y-m-d');
        $to_date = isset($data['to_date']) ? $data['to_date'] : now()->format('Y-m-d');
        $revenues = Order::whereDate('created_at', '>=', $from_date)
            ->whereDate('created_at', '<=', $to_date)
            ->selectRaw('DATE(created_at) as date, sum(total) as total_revenue')
            ->groupBy('date')
            ->orderBy('date')
            ->get();
---
select DATE(created_at) as date, sum(total) as total_revenue from `orders` where date(`created_at`) >= '2024-07-07' and date(`created_at`) <= '2024-08-06' group by `date` order by `date` asc

    public function chart_dashboard()
    {
        $currentYear = now()->year;
        $currentMonth = now()->month;
        // Lấy tổng total của 2 năm gần đây nhất
        $revenues = Order::selectRaw('YEAR(created_at) as year, SUM(total) as total_revenue')
            ->whereYear('created_at', '>=', $currentYear - 1)
            ->where('pay', '=', 1) // Thêm điều kiện pay khác 0
            ->groupBy('year')
            ->orderBy('year', 'desc')
            ->get();
        // Phần trăm total của năm nay so với năm trước
        $currentYearRevenue = $revenues->where('year', $currentYear)->first()->total_revenue ?? 0;
        $lastYearRevenue = $revenues->where('year', $currentYear - 1)->first()->total_revenue ?? 0;
        // dd($currentYearRevenue,$lastYearRevenue);
        if ($lastYearRevenue != 0) {
            $percentageChangeYear = round((($currentYearRevenue - $lastYearRevenue) / $lastYearRevenue) * 100, 2);
        } else {
            $percentageChangeYear = 0;
        }

        // Lấy tổng tiền thu nhập được của các tháng trong năm
        $revenuesMonth = Order::selectRaw('MONTH(created_at) as month, SUM(total) as total_revenue')
            ->whereRaw('YEAR(created_at) = ?', [$currentYear])
            ->where('pay', '=', 1)
            ->groupBy('month')
            ->orderBy('month')
            ->get();
---
select YEAR(created_at) as year, SUM(total) as total_revenue from `orders` where year(`created_at`) >= 2023 and `pay` = 1 group by `year` order by `year` desc
select MONTH(created_at) as month, SUM(total) as total_revenue from `orders` where YEAR(created_at) = 2024 and `pay` = 1 group by `month` order by `month` asc

        $currentMonthTotal = $revenuesMonth->where('month', $currentMonth)->sum('total_revenue');

        // Lượt xem cao nhất
        $topViewProducts = Product::withTrashed()->orderBy('view', 'desc')
            ->take(6)
            ->get();


        // Số lượng loại sản phẩm
        $categories = Category::all();
        foreach ($categories as $category) {
            $category->qty = Product::where('idCategory', $category->id)->count();
        };
        $brands = Brand::all();
        foreach ($brands as $brand) {
            $brand->qty = Product::where('idBrand', $brand->id)->count();
        };

        $totalProductsCount = Product::withTrashed()->count();
        $totalBlogsCount = Blog::withTrashed()->count();
        $totalUsersCount = User::withTrashed()->count();


        $topSellingProducts = Cart::selectRaw('idProduct, SUM(qty) as totalQty')
            ->whereNotNull('idOrder')
            ->groupBy('idProduct')
            ->orderByDesc('totalQty')
            ->limit(4)
            ->get();
        $topSellingProductDetails = [];
        $images = Image::all();
        foreach ($topSellingProducts as $topSellingProduct) {
            $product = Product::withTrashed()->find($topSellingProduct->idProduct);
---
select * from `products` order by `view` desc limit 6
select * from `categories` where `categories`.`deleted_at` is null
select count(*) as aggregate from `products` where `idCategory` = 1 and `products`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null
select count(*) as aggregate from `products` where `idBrand` = 1 and `products`.`deleted_at` is null
select count(*) as aggregate from `products`
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `users`
select idProduct, SUM(qty) as totalQty from `carts` where `idOrder` is not null group by `idProduct` order by `totalQty` desc limit 4
select * from `images`
select * from `products` where `products`.`id` = 23 limit 1