app/Http/Controllers/HomeController.php

select * from `banners`
select * from `products` where `products`.`deleted_at` is null order by `view` desc limit 8
select `id`, `idBlog`, `srcImage` from `images` where `images`.`idBlog` in (5, 6)
select `id`, `title`, `created_at` from `blogs` where `blogs`.`deleted_at` is null order by `created_at` desc limit 3
select * from `images`
---
    public function home()
    {
        $banners = Banner::get();
        $products = Product::orderByDesc('view')->limit(8)->get();
        $blogs = Blog::select('id', 'title', 'created_at')
            ->with(['image' => function ($query) {
                $query->select('id', 'idBlog', 'srcImage');
            }])
            ->orderBy('created_at', 'desc') // Order by creation date in descending order
            ->limit(3)
            ->get();
        $images = Image::all();

select * from `categories` where `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null
---
    public function listProduct(Request $request)
    {
        $categories = Category::get();
        $brands = Brand::get();

select * from `images` where `idProduct` in (1, 15, 16, 17, 20, 21, 22, 23, 24, 25, 26, 27)
---

        $products = $query->with('images')->paginate(12);
        $productIds = $products->pluck('id')->toArray();
        $images = Image::whereIn('idProduct', $productIds)->get();

select * from `products` where `id` = '27' and `products`.`deleted_at` is null limit 1
select * from `comments` where `idProduct` = '27'
select * from `users` where `users`.`id` in (29) and `users`.`deleted_at` is null
select count(*) as aggregate from `comments` where `idProduct` = '1' and `idUser` is null
select * from `brands` where `brands`.`id` in (1)
select * from `categories` where `categories`.`id` in (1)
select * from `images` where `idProduct` = '27'
select * from `carts` where `idProduct` = '1' and `idUser` is null limit 1
select * from `orders` where `id` is null and `pay` = 1 limit 1
select * from `products` where `idCategory` = 1 and `idBrand` = 1 and `id` <> 27 and `products`.`deleted_at` is null limit 4
select * from `images` where `idProduct` = 1 limit 1
update `products` set `view` = 7, `products`.`updated_at` = '2024-09-21 16:10:58' where `id` = '27' and `products`.`deleted_at` is null
---
    public function detailProduct($id)
    {
        $product = Product::where('id', $id)->first();
        $comments = Comment::where('idProduct', $id)->with('user')->get();
        $countCommentUser = Comment::where('idProduct', $id)->where('idUser', optional(Auth::user())->id)->count();
        $averageRating = $product->averageRating();
        $product->load('size', 'category', 'brand');
        $images = Image::where('idProduct', $id)->get();

        $productImage = $images->where('idProduct', $product->id)->first();

        $cart = Cart::where('idProduct', $id)->where('idUser', optional(Auth::user())->id)->first();

        if ($cart) {
            $order = Order::where('id', $cart->idOrder)
                ->where('pay', 1) // Thêm điều kiện kiểm tra trường pay
                ->first();
        } else {
            $order = null; // Đặt $order thành null nếu không có giỏ hàng
        }

        $relatedProducts = Product::where('idCategory', $product->idCategory)->where('idBrand', $product->idBrand)->where('id', '<>', $product->id)->take(4)->get();
        //gán ảnh
        foreach ($relatedProducts as $relatedProduct) {
            $relatedProduct->srcImage = Image::where('idProduct', $relatedProduct->id)->first()->srcImage;
        }
        //tăng lượt xem
        Product::where('id', $id)->update(['view' => $product->view + 1]);