app/Http/Controllers/OrderController.php

select * from `carts` where `idUser` = 21 and `idOrder` is null
insert into `carts` (`idProduct`, `qty`, `size`, `idUser`) values ('27', '3', 's', 21)
---
    public function addToCart(Request $request, $idProduct)
    {
        $carts = Cart::where('idUser', Auth::user()->id)->where('idOrder', null)->get();
        $check = true;
        foreach ($carts as $cart) {
            //TH sản phẩm trong giỏ cùng loại với sản phẩm vừa thêm
            if ($cart->idProduct == $idProduct && $cart->size == $request->size) {
                Cart::where('id', $cart->id)->update(['qty' => $cart->qty + $request->qty]);
                $check = false;
                break;
            }
        }
        if ($check == true) {
            Cart::insert([
                'idProduct' => $idProduct,
                'qty' => $request->qty,
                'size' => $request->size,
                'idUser' => Auth::user()->id,
            ]);

select * from `images`
select * from `carts` where `idUser` = 35 and `idOrder` is null
select * from `products` where `products`.`id` in (1) and `products`.`deleted_at` is null
---
    public function viewCart()
    {
        $images = Image::all();
        $carts = Cart::where('idUser', Auth::user()->id)->where('idOrder', null)->get();
        $carts->load('product');

select * from `vouchers` where `code` = '#MFashion2023' limit 1
select * from `carts` where `idUser` = 21 and `idOrder` is null
select * from `products` where `products`.`id` in (15) and `products`.`deleted_at` is null
---
    public function discountCode(Request $request)
    {
        //Check code nhập vào có tồn tại hay không
        $voucher = Voucher::where('code', $request->code)->first();
        //nếu tồn tại
        if (!is_null($voucher)) {
            //Check số lượng code còn hay không
            if ($voucher->number > 0) {
                //Check ngày bắt đầu và ngày kết thúc code
                $nowDay = Carbon::now('Asia/Ho_Chi_Minh');
                if ($nowDay >= $voucher->dateStart && $nowDay < $voucher->dateEnd) {
                    $user = Auth::user();
                    $carts = Cart::where('idUser', $user->id)->where('idOrder', null)->get();
                    $carts->load('product');

select * from `carts` where `idUser` = 21 and `idOrder` is null
select * from `products` where `products`.`id` in (15) and `products`.`deleted_at` is null
---
    public function getFormCheckOut()
    {
        $user = Auth::user();
        $carts = Cart::where('idUser', $user->id)->where('idOrder', null)->get();
        $carts->load('product');

select * from `orders` where `idUser` = 35 order by `id` desc
---
    public function listOrder()
    {
        $orders = Order::where('idUser', Auth::user()->id)->orderByDesc('id')->get();