app/Http/Controllers/ProductController.php

select * from `products`
select * from `images`
select * from `brands` where `brands`.`id` in (1, 2, 3, 6)
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6)
---
    public function index(Request $request)
    {
        $products = Product::withTrashed()->get();
        // dd($products);
        $images = Image::all();
        $products->load(['size', 'category', 'brand']);

select * from `brands` where `brands`.`deleted_at` is null
select * from `categories` where `categories`.`deleted_at` is null
---
    public function create()
    {
        $brands = Brand::all();
        $categories = Category::all();